let r = prompt('сторона');
let s = 3.14 * r ** 2;
alert('площадь круга ' + s);
/*#2*/
let a = prompt('сторона кв');
s = a ** 2;
alert('площадь квадрата ' + s);
/*#3*/
a = prompt('сторона прям a');
let b = prompt('сторона прям b');
s = a * b;
alert('площадь прям ' + s);
/*#4*/
let  p = (a + b) * 2;
alert('периметр прям ' + p);
/*#5*/
let tc = prompt('градусы по цельсию');
alert( 'градусы по фаренгейту ' + ((tc * 9 / 5) + 32));
/*#6*/
let tf = prompt('градусы по фаренгейту');
alert( 'градусы по цельсию ' + ((tf - 32) *  5 / 9));
